In [1]:
print('Helloeff')

Helloeff

In [2]:
pip install pandas

Requirement already satisfied: pandas in c:\users\lenovo\documents\workspace\sam-data\spark-practs\venv\lib\site-packages (2.2.0)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: numpy<2,>=1.23.2 in c:\users\lenovo\documents\workspace\sam-data\spark-practs\venv\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\lenovo\documents\workspace\sam-data\spark-practs\venv\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\lenovo\documents\workspace\sam-data\spark-practs\venv\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\lenovo\documents\workspace\sam-data\spark-practs\venv\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\lenovo\documents\workspace\sam-data\spark-practs\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [3]:
pip install pyspark

Requirement already satisfied: pyspark in c:\users\lenovo\documents\workspace\sam-data\spark-practs\venv\lib\site-packages (3.1.1)
Requirement already satisfied: py4j==0.10.9 in c:\users\lenovo\documents\workspace\sam-data\spark-practs\venv\lib\site-packages (from pyspark) (0.10.9)
Note: you may need to restart the kernel to use updated packages.

In [4]:
from pyspark.sql import SparkSession

spark = SparkSession.builder \
    .appName("YourAppName2") \
    .getOrCreate()

In [5]:
# Example: Read data from a CSV file
PATH = r'C:\Users\LENOVO\Downloads\sales.csv'
df = spark.read.csv(PATH, header=True, inferSchema=True)

In [6]:
# Show the first few rows of the DataFrame
df.show()

# Display the schema of the DataFrame
df.printSchema()

# Perform basic statistics
df.describe().show()

+---+---+-----------+-----+----------+
|  1|  A| 2023-01-01|India|    Swiggy|
+---+---+-----------+-----+----------+
|  2|  A| 2022-01-01|India|    Swiggy|
|  2|  A| 2023-01-07|India|    Swiggy|
|  3|  A| 2023-01-10|India|Restaurant|
|  3|  A| 2022-01-11|India|    Swiggy|
|  3|  A| 2023-01-11|India|Restaurant|
|  2|  B| 2022-02-01|India|    Swiggy|
|  2|  B| 2023-01-02|India|    Swiggy|
|  1|  B| 2023-01-04|India|Restaurant|
|  1|  B| 2023-02-11|India|    Swiggy|
|  3|  B| 2023-01-16|India|    zomato|
|  3|  B| 2022-02-01|India|    zomato|
|  3|  C| 2023-01-01|India|    zomato|
|  1|  C| 2023-01-01|   UK|    Swiggy|
|  6|  C| 2022-01-07|   UK|    zomato|
|  3|  D| 2023-02-16|   UK|Restaurant|
|  5|  D| 2022-02-01|   UK|    zomato|
|  3|  E| 2023-02-01|   UK|Restaurant|
|  4|  E| 2023-02-01|   UK|    Swiggy|
|  4|  E| 2023-02-07|   UK|Restaurant|
|  2|  A| 2022-01-01|   UK|    Swiggy|
+---+---+-----------+-----+----------+
only showing top 20 rows

root
 |-- 1: integer (nullable = true)
 |-- A: string (nullable = true)
 |--  2023-01-01: string (nullable = true)
 |-- India: string (nullable = true)
 |-- Swiggy: string (nullable = true)

+-------+------------------+----+-----------+-----+----------+
|summary|                 1|   A| 2023-01-01|India|    Swiggy|
+-------+------------------+----+-----------+-----+----------+
|  count|               116| 116|        116|  116|       116|
|   mean| 2.810344827586207|null|       null| null|      null|
| stddev|1.2847858431149786|null|       null| null|      null|
|    min|                 1|   A| 2022-01-01|India|Restaurant|
|    max|                 6|   E| 2023-11-11|  USA|    zomato|
+-------+------------------+----+-----------+-----+----------+

In [7]:
import pandas as pd
PATH = r'C:\Users\LENOVO\Downloads\sales.csv'
pd.read_csv(PATH, on_bad_lines='skip')

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_11888\1072231949.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

     1  A   2023-01-01  India      Swiggy
0    2  A   2022-01-01  India      Swiggy
1    2  A   2023-01-07  India      Swiggy
2    3  A   2023-01-10  India  Restaurant
3    3  A   2022-01-11  India      Swiggy
4    3  A   2023-01-11  India  Restaurant
..  .. ..          ...    ...         ...
108  3  D   2022-11-16    USA      zomato
109  5  D   2023-11-06    USA      zomato
110  3  E   2023-11-06    USA      Swiggy
111  4  E   2022-11-06    USA      zomato
112  4  E   2023-11-11    USA      zomato

[113 rows x 5 columns]

In [8]:
spark

In [9]:
df_pyspark=spark.read.csv('menu.csv')

In [10]:
df_pyspark

DataFrame[_c0: string, _c1: string, _c2: string]

In [11]:

df_pyspark.show()

+---+---------+-----+
|_c0|      _c1|  _c2|
+---+---------+-----+
| Id|     Name|Price|
|  1|    PIZZA|  100|
|  2|  Chowmin|  150|
|  3| sandwich|  120|
|  4|     Dosa|  110|
|  5|  Biryani|   80|
|  6|    Pasta|  180|
+---+---------+-----+

In [12]:
df_pyspark = spark.read.option('header','true').csv('menu.csv')
df_pyspark.show()
type(df_pyspark)

+---+---------+-----+
| Id|     Name|Price|
+---+---------+-----+
|  1|    PIZZA|  100|
|  2|  Chowmin|  150|
|  3| sandwich|  120|
|  4|     Dosa|  110|
|  5|  Biryani|   80|
|  6|    Pasta|  180|
+---+---------+-----+

pyspark.sql.dataframe.DataFrame

In [13]:
type(df_pyspark)

pyspark.sql.dataframe.DataFrame

In [14]:
df_pyspark.printSchema()

root
 |-- Id: string (nullable = true)
 |-- Name: string (nullable = true)
 |-- Price: string (nullable = true)

In [15]:
df_pyspark = spark.read.option('header','true').csv('menu.csv',inferSchema=True)
df_pyspark.show()

+---+---------+-----+
| Id|     Name|Price|
+---+---------+-----+
|  1|    PIZZA|  100|
|  2|  Chowmin|  150|
|  3| sandwich|  120|
|  4|     Dosa|  110|
|  5|  Biryani|   80|
|  6|    Pasta|  180|
+---+---------+-----+

In [16]:
df_pyspark.columns

['Id', 'Name', 'Price']

In [17]:
df_pyspark.head(2)

[Row(Id=1, Name=' PIZZA', Price=100), Row(Id=2, Name=' Chowmin', Price=150)]

In [18]:
df_pyspark.select('Name').show()

+---------+
|     Name|
+---------+
|    PIZZA|
|  Chowmin|
| sandwich|
|     Dosa|
|  Biryani|
|    Pasta|
+---------+

In [19]:
df_pyspark.select(['Id','Name']).show()

+---+---------+
| Id|     Name|
+---+---------+
|  1|    PIZZA|
|  2|  Chowmin|
|  3| sandwich|
|  4|     Dosa|
|  5|  Biryani|
|  6|    Pasta|
+---+---------+

In [20]:
df_pyspark.dtypes

[('Id', 'int'), ('Name', 'string'), ('Price', 'int')]

In [21]:
df_pyspark.describe()

DataFrame[summary: string, Id: string, Name: string, Price: string]

In [22]:
df_pyspark.describe().show()

+-------+------------------+---------+------------------+
|summary|                Id|     Name|             Price|
+-------+------------------+---------+------------------+
|  count|                 6|        6|                 6|
|   mean|               3.5|     null|123.33333333333333|
| stddev|1.8708286933869707|     null| 36.14784456460256|
|    min|                 1|  Biryani|                80|
|    max|                 6| sandwich|               180|
+-------+------------------+---------+------------------+

In [23]:
### Adding columns in data frame
df_pyspark = df_pyspark.withColumn('Price in 2024',df_pyspark['Price']+10)

In [24]:
df_pyspark.show()

+---+---------+-----+-------------+
| Id|     Name|Price|Price in 2024|
+---+---------+-----+-------------+
|  1|    PIZZA|  100|          110|
|  2|  Chowmin|  150|          160|
|  3| sandwich|  120|          130|
|  4|     Dosa|  110|          120|
|  5|  Biryani|   80|           90|
|  6|    Pasta|  180|          190|
+---+---------+-----+-------------+

In [25]:
### Drop the coolumns
df_pyspark = df_pyspark.drop('Price in 2024')
df_pyspark.show()

+---+---------+-----+
| Id|     Name|Price|
+---+---------+-----+
|  1|    PIZZA|  100|
|  2|  Chowmin|  150|
|  3| sandwich|  120|
|  4|     Dosa|  110|
|  5|  Biryani|   80|
|  6|    Pasta|  180|
+---+---------+-----+

In [26]:
### Rename the columns
df_pyspark = df_pyspark.withColumnRenamed('Name','Dish Name')
df_pyspark.show()

+---+---------+-----+
| Id|Dish Name|Price|
+---+---------+-----+
|  1|    PIZZA|  100|
|  2|  Chowmin|  150|
|  3| sandwich|  120|
|  4|     Dosa|  110|
|  5|  Biryani|   80|
|  6|    Pasta|  180|
+---+---------+-----+

In [27]:
df_spark2 = spark.read.csv('test2.csv',header=True,inferSchema=True)
df_spark2

DataFrame[Name: string, age: int, Experience: int, Salary: int]

In [28]:
df_spark2.show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|null|      null| 40000|
|     null|  34|        10| 38000|
|     null|  36|      null|  null|
+---------+----+----------+------+

In [29]:
df_spark2 = df_spark2.withColumn('Salary After Appraisal',df_spark2['Salary']+2000)
df_spark2.show()

+---------+----+----------+------+----------------------+
|     Name| age|Experience|Salary|Salary After Appraisal|
+---------+----+----------+------+----------------------+
|    Krish|  31|        10| 30000|                 32000|
|Sudhanshu|  30|         8| 25000|                 27000|
|    Sunny|  29|         4| 20000|                 22000|
|     Paul|  24|         3| 20000|                 22000|
|   Harsha|  21|         1| 15000|                 17000|
|  Shubham|  23|         2| 18000|                 20000|
|   Mahesh|null|      null| 40000|                 42000|
|     null|  34|        10| 38000|                 40000|
|     null|  36|      null|  null|                  null|
+---------+----+----------+------+----------------------+

In [30]:
df_spark2 = df_spark2.withColumnRenamed('Name','Employee Name')
df_spark2.show()

+-------------+----+----------+------+----------------------+
|Employee Name| age|Experience|Salary|Salary After Appraisal|
+-------------+----+----------+------+----------------------+
|        Krish|  31|        10| 30000|                 32000|
|    Sudhanshu|  30|         8| 25000|                 27000|
|        Sunny|  29|         4| 20000|                 22000|
|         Paul|  24|         3| 20000|                 22000|
|       Harsha|  21|         1| 15000|                 17000|
|      Shubham|  23|         2| 18000|                 20000|
|       Mahesh|null|      null| 40000|                 42000|
|         null|  34|        10| 38000|                 40000|
|         null|  36|      null|  null|                  null|
+-------------+----+----------+------+----------------------+

In [45]:
df_spark2 = df_spark2.drop('Salary After Appraisal')
df_spark2.show()

+-------------+----+----------+------+
|Employee Name| age|Experience|Salary|
+-------------+----+----------+------+
|        Krish|  31|        10| 30000|
|    Sudhanshu|  30|         8| 25000|
|        Sunny|  29|         4| 20000|
|         Paul|  24|         3| 20000|
|       Harsha|  21|         1| 15000|
|      Shubham|  23|         2| 18000|
|       Mahesh|null|      null| 40000|
|         null|  34|        10| 38000|
|         null|  36|      null|  null|
+-------------+----+----------+------+

In [32]:
df_spark2.na.drop().show() ### Drops all Rows even if single column in NULL

+-------------+---+----------+------+
|Employee Name|age|Experience|Salary|
+-------------+---+----------+------+
|        Krish| 31|        10| 30000|
|    Sudhanshu| 30|         8| 25000|
|        Sunny| 29|         4| 20000|
|         Paul| 24|         3| 20000|
|       Harsha| 21|         1| 15000|
|      Shubham| 23|         2| 18000|
+-------------+---+----------+------+

In [33]:
### any==how any means drop rows if any of the column is null and how=all means if all columns in that record is null
df_spark2.na.drop(how='all').show()

+-------------+----+----------+------+
|Employee Name| age|Experience|Salary|
+-------------+----+----------+------+
|        Krish|  31|        10| 30000|
|    Sudhanshu|  30|         8| 25000|
|        Sunny|  29|         4| 20000|
|         Paul|  24|         3| 20000|
|       Harsha|  21|         1| 15000|
|      Shubham|  23|         2| 18000|
|       Mahesh|null|      null| 40000|
|         null|  34|        10| 38000|
|         null|  36|      null|  null|
+-------------+----+----------+------+

In [34]:
##threshold -> limit or count of columns which can stay null upto which it will be dropped
df_spark2.na.drop(how='any',thresh=2).show()

+-------------+----+----------+------+
|Employee Name| age|Experience|Salary|
+-------------+----+----------+------+
|        Krish|  31|        10| 30000|
|    Sudhanshu|  30|         8| 25000|
|        Sunny|  29|         4| 20000|
|         Paul|  24|         3| 20000|
|       Harsha|  21|         1| 15000|
|      Shubham|  23|         2| 18000|
|       Mahesh|null|      null| 40000|
|         null|  34|        10| 38000|
+-------------+----+----------+------+

In [35]:
##Subset dropping record based on column name being Null
df_spark2.na.drop(how='any',subset=['Experience']).show()

+-------------+---+----------+------+
|Employee Name|age|Experience|Salary|
+-------------+---+----------+------+
|        Krish| 31|        10| 30000|
|    Sudhanshu| 30|         8| 25000|
|        Sunny| 29|         4| 20000|
|         Paul| 24|         3| 20000|
|       Harsha| 21|         1| 15000|
|      Shubham| 23|         2| 18000|
|         null| 34|        10| 38000|
+-------------+---+----------+------+

In [38]:
###Filling missing values
df_spark2.na.fill('Missing Values',['Experience','age']).show()

+-------------+----+----------+------+
|Employee Name| age|Experience|Salary|
+-------------+----+----------+------+
|        Krish|  31|        10| 30000|
|    Sudhanshu|  30|         8| 25000|
|        Sunny|  29|         4| 20000|
|         Paul|  24|         3| 20000|
|       Harsha|  21|         1| 15000|
|      Shubham|  23|         2| 18000|
|       Mahesh|null|      null| 40000|
|         null|  34|        10| 38000|
|         null|  36|      null|  null|
+-------------+----+----------+------+

In [40]:
filled_df_spark2 = df_spark2.na.fill('Missing Values', ['Experience', 'age'])

# Show the DataFrame after filling null values
print("DataFrame after filling null values:")
filled_df_spark2.show()

DataFrame after filling null values:
+-------------+----+----------+------+
|Employee Name| age|Experience|Salary|
+-------------+----+----------+------+
|        Krish|  31|        10| 30000|
|    Sudhanshu|  30|         8| 25000|
|        Sunny|  29|         4| 20000|
|         Paul|  24|         3| 20000|
|       Harsha|  21|         1| 15000|
|      Shubham|  23|         2| 18000|
|       Mahesh|null|      null| 40000|
|         null|  34|        10| 38000|
|         null|  36|      null|  null|
+-------------+----+----------+------+

In [50]:
### Imputer function
from pyspark.ml.feature import Imputer
imputer = Imputer(
    inputCols=['age','Experience','Salary'],
    outputCols=["{}_imputed".format(c) for c in ['age','Experience','Salary']]
).setStrategy("means")
# Add imputation cols to df
# imputer.fit(df_spark2).transform(df_spark2).show()

Filter Operation

In [51]:
df_spark2 = spark.read.csv('test2.csv',header=True,inferSchema=True)
df_spark2

DataFrame[Name: string, age: int, Experience: int, Salary: int]

In [52]:
### Salary of people less than or equal to 2000
df_spark2.filter("Salary<=20000").show()

+-------+---+----------+------+
|   Name|age|Experience|Salary|
+-------+---+----------+------+
|  Sunny| 29|         4| 20000|
|   Paul| 24|         3| 20000|
| Harsha| 21|         1| 15000|
|Shubham| 23|         2| 18000|
+-------+---+----------+------+

In [53]:
df_spark2.filter("Salary<=20000").select(['Name','age']).show()

+-------+---+
|   Name|age|
+-------+---+
|  Sunny| 29|
|   Paul| 24|
| Harsha| 21|
|Shubham| 23|
+-------+---+

In [62]:
df_spark2.filter((df_spark2['Salary']<=20000) | (df_spark2['Salary']>=15000)).show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|null|      null| 40000|
|     null|  34|        10| 38000|
+---------+----+----------+------+

In [64]:
## Not operation
df_spark2.filter(~(df_spark2['Salary']<=20000)).show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|   Mahesh|null|      null| 40000|
|     null|  34|        10| 38000|
+---------+----+----------+------+

GroupBy and Aggregate Functions

In [65]:
df_spark2 = spark.read.csv('test3.csv',header=True,inferSchema=True)
df_spark2

DataFrame[Name: string, Departments: string, salary: int]